cf_billing/AccumulationRegisters/энргАвансы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргАвансы</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОплаты</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргРасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПлатежноеПоручениеВходящие</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРегистров</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОперацияПоПлатежнойКарте</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПерерасчет</v8:Type>
						<v8:Type>cfg:DocumentRef.энргРаспределениеМКД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/энргАвансыИспользованные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргАвансыИспользованные</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПеня</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОплаты</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргРасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПлатежноеПоручениеВходящие</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРегистров</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОперацияПоПлатежнойКарте</v8:Type>
						<v8:Type>cfg:DocumentRef.энргНачисление</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПерерасчет</v8:Type>
						<v8:Type>cfg:DocumentRef.энргРаспределениеМКД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/энргАвансыПоступившие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргАвансыПоступившие</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Кассир</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникПоступления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргИсточникиПоступления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/энргВзаиморасчеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргВзаиморасчеты</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/энргВзаиморасчетыПоМесяцам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргВзаиморасчетыПоМесяцам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/энргВзаиморасчетыПоПени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргВзаиморасчетыПоПени</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/энргЗадолженностьПоРассрочке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргЗадолженностьПоРассрочке</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаЗадолженности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/CommonModules/энргДатыЗапретаИзмененияПереопределяемый/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Позволяет изменить работу интерфейса при встраивании.
//
// Параметры:
//  НастройкиРаботыИнтерфейса - Структура - содержит свойство:
//   * ИспользоватьВнешнихПользователей - Булево - (начальное значение Ложь),
//     если установить Истина, тогда даты запрета можно будет настраивать для внешних пользователей.
//
Процедура НастройкаИнтерфейса(НастройкиРаботыИнтерфейса) Экспорт
	
	
	
КонецПроцедуры

// Заполняет разделы дат запрета изменения, используемые при настройке дат запрета.
// Если не указать ни одного раздела, тогда будет доступна только настройка общей даты запрета.
//
// Параметры:
//  Разделы - ТаблицаЗначений - с колонками:
//   * Имя - Строка - имя используемое в описании источников данных в
//       процедуре ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения.
//
//   * Идентификатор - УникальныйИдентификатор - идентификатор ссылки элемента плана видов характеристик.
//       Чтобы получить идентификатор нужно в режиме 1С:Предприятия выполнить метод платформы:
//       "ПланыВидовХарактеристик.РазделыДатЗапретаИзменения.ПолучитьСсылку().УникальныйИдентификатор()".
//       Не следует указывать идентификаторы, полученные любым другим способом,
//       так как это может нарушить их уникальность.
//
//   * Представление - Строка - представляет раздел в форме настройки дат запрета.
//
//   * ТипыОбъектов  - Массив - типы ссылок объектов в разрезе которых можно настроить даты запрета,
//       например, Тип("СправочникСсылка.Организации"), если не указано ни одного типа,
//       то даты запрета будут настраиваться только с точностью до раздела.
//
Процедура ПриЗаполненииРазделовДатЗапретаИзменения(Разделы) Экспорт
	
	Раздел = Разделы.Добавить();
	Раздел.Имя  = "Район";
	Раздел.Идентификатор = КлючРазделаРайон();
	Раздел.Представление = НСтр("ru = 'Районы'");
	Раздел.ТипыОбъектов.Добавить(Тип("СправочникСсылка.энргЗоныОтвественности"));
	
	Раздел = Разделы.Добавить();
	Раздел.Имя  = "Организация";
	Раздел.Идентификатор = Новый УникальныйИдентификатор("bbb4fb14-3ed6-4968-ba89-caebbbe7cf5f");
	Раздел.Представление = НСтр("ru = 'Организация'");
	Раздел.ТипыОбъектов.Добавить(Тип("СправочникСсылка.Организации"));	
	
КонецПроцедуры

// Позволяет задать таблицы и поля объектов для проверки запрета изменения данных.
// Для добавления нового источника в ИсточникиДанных см. ДатыЗапретаИзменения.ДобавитьСтроку.
//
// Вызывается из процедуры ИзменениеЗапрещено общего модуля ДатыЗапретаИзменения,
// используемой в подписке на событие ПередЗаписью объекта для проверки наличия
// запретов и отказа от изменений запрещенного объекта.
//
// Параметры:
//  ИсточникиДанных - ТаблицаЗначений - с колонками:
//   * Таблица     - Строка - полное имя объекта метаданных,
//                   например, Метаданные.Документы.ПриходнаяНакладная.ПолноеИмя().
//   * ПолеДаты    - Строка - имя реквизита объекта или табличной части,
//                   например "Дата", "Товары.ДатаОтгрузки".
//   * Раздел      - Строка - имя раздела дат запрета, указанного в
//                   процедуре ПриЗаполненииРазделовДатЗапретаИзменения (см. выше).
//   * ПолеОбъекта - Строка - имя реквизита объекта или реквизита табличной части,
//                   например "Организация", "Товары.Склад".
//
Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.КассоваяСмена", "Дата");
	 
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргВводНачальныхОстатков", 									"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргВводНачальныхОстатковМКД", 								"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргЗакрытиеПериода", 										"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргПриходныйКассовыйОрдер", 								"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргИзменитьПризнакРасчетаТолькоПоПоказаниям",				"Дата" , "Район", "Район");	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргНачисление", 											"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргНачислениеМКД",											"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргРаспределениеМКД",										"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргНачислениеНаПрочиеУслуги", 								"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргНачислениеПени", 										"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргНачислениеПоРассрочке", 									"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргОбходнойЛист", 											"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргОперацияСЛицевымСчетом", 								"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргОперацияСПриборомУчета", 								"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргОперацияСПриборомУчетаМКД", 								"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргОперацияСУслугами", 										"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргОперацияСУслугамиМКД", 									"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргОткрытиеМКД", 											"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргПерерасчет", 											"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргПерерасчетМКД", 											"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргПлатежноеПоручениеВходящие", 							"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргПоступлениеОплатыЧерезКонтроллера", 						"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргРасчетДебиторскойЗадолженности", 						"Дата" , "Район", "Район"); 
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргРегистрацияАварийностиСтроения", 						"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргРегистрацияВременногоОтсутствия", 						"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргРегистрацияОбъемаПотребленияНеЖилыхПомещений",			"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргРегистрацияПоказанийАбонента", 							"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргРегистрацияПоказанийМКД", 								"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргРегистрацияРазовыхНачислений", 							"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргРеестрСформированныхДебиторскихЗадолженностей", 			"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргБанкротство",				 							"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргСменаПоставщика", 										"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргСменаПоставщикаМКД",										"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргУстановитьБойлерМКД",									"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргУстановитьВидБлагоустройстваАбонента", 					"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргУстановитьВидБлагоустройстваМКД", 						"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргУстановитьГруппуПотребителейАбонента", 					"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргУстановитьДатуПоверкиПУ", 								"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргУстановитьЗначениеПлощади", 								"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргУстановитьЗначениеПлощадиМКД", 							"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргУстановитьЗначениеТарифа", 								"Дата" , "", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргУстановитьКоличествоКомнат", 							"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргУстановитьКоличествоПрописанных", 						"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргУстановитьСтатусАбонентовОтключаемыхВНеполивнойСезон", 	"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргУстановитьСхемуПодчиненностиТочекУчета", 				"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргУстановитьФормулуРасчетаТочекУчета", 					"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргУстановкаСнятиеОграничения", 							"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргЭтапПретензионноИсковойДеятельности", 					"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргУстановитьВидДифференцированностиПриборУчета",			"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргЗагрузкаДанныхИзВнешнихСистем",							"Дата" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргЗагрузкаПоказанийИзВнешнихИсточников",					"Дата" , );
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргУстановитьВидДифференцированностиПриборУчетаМКД",		"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргУстановитьНормуПотребленияПоУслуге",						"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргОперацияПоПлатежнойКарте",								"Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргОтчетБанкаПоОперациямЭквайринга",						"Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргРасходныйКассовыйОрдер",									"Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргКорректировкаГодовогоПотребления",						"Дата", "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргИзменениеСпособаДоставкиКвитанции",						"Дата", "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргУстановитьКоличествоПроживающих",						"Дата", "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргУстановитьКоличествоСобственников",						"Дата", "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргУстановитьСпособРаспределенияОбъемаМКДНаАбонентов",		"Дата", "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргНачислениеДляЛьготныхЛиц", 								"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргОбходнойЛистМКД", 										"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргИзменениеЛьготыЖильцам", 								"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргСоглашениеОПотребленииВПомещении", 						"Дата" , "Район", "Район");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргПереводПомещенияВПомещениеСРазделеннымиЛС", 				"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргРаспределениеПомещения", 								"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргСменаТипаСобственности", 								"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестИзмененияОкружающейСреды", 								"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргИзменениеКоличестваПрописанныхПроживающихСобственников", "Дата" , "Район", "Район");
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргУстановитьЗначенияИзмерителей",						 	"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргАктированиеНедопускаДопускаВПомещение",					"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргАктНесанкционированногоПодключенияВмешательства",		"Дата" , "Район", "Район");
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргУстановитьТехническийСтатусТочкиУчета", 					"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргУстановитьТехническуюВозможностьУстановкиПУ", 			"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргСоглашениеОРаспределенииСверхнормативногоОДН", 			"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргАктБездоговорногоПотребления", 							"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргУстановитьДополнительнуюСоциальнуюНорму", 				"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргРегистрацияУполномоченныхЛиц",							"Дата");
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргИзменитьНомерПломбыПрибораУчетаАбоненты",				"Дата");
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргИзменитьФормуУправленияМКД",								"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.бестНазначениеОтветственногоПИР",							"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргОперацииСФиксированнымиОбъемамиМКД",						"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргРегистрацияРасчетаПениАбонента",							"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргУстановитьНазначениеПУ",									"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргИстечениеДатыПоверкиПУ",									"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргМассовыйВводПоказаний",									"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргЗагрузкаДанныхИзВнешнихИсточников",						"Дата" , "Район", "Район");	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргИзменитьНомерПломбыПрибораУчетаМКД",			            "Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргРегистрацияПретензийОтПотребителяИсполнителя",			"Дата" , "Район", "Район");
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.энргАвансы", 										"Период" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.энргАвансыИспользованные", 							"Период" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.энргАвансыПоступившие", 							"Период" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.энргВзаиморасчеты", 								"Период" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.энргВзаиморасчетыПоМесяцам", 						"Период" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.энргВзаиморасчетыПоПени", 							"Период" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.энргЗабалансоваяЗадолженность", 					"Период" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.энргЗадолженностьПоРассрочке", 						"Период" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.энргНачисленныйСреднийОбъем", 						"Период" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.энргНачисленныйСреднийОбъемМКД", 					"Период" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.энргОбъемДоначислений", 							"Период" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.энргОбъемКорректировкиМКД", 						"Период" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.энргОбъемНачислений", 								"Период" , "Район", "Район");
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.энргОбъемНачисленийДляЛьготныхЛиц", 				"Период" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.энргОбъемНачисленийМКД", 							"Период" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.энргОбъемНачисленийПомещенийСРазделеннымиЛС", 		"Период" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.энргОбъемНачисленийПрочихУслуг", 					"Период" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.энргОбъемНачисленийСверхнормативаМКД", 				"Период" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.энргОбъемПерерасчета", 								"Период" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.энргОбъемПотребленияНежилыхПомещений", 				"Период" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.энргОплатаУслуг", 									"Период" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.энргПроцентыПоРассрочке", 							"Период" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.энргКорректировкиПотребленияАбонентовДляОДН", 		"Период" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.энргОплатаПени", 									"Период" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.энргНачислениеПени", 								"Период" , "Район", "Район");
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргРучноеИзменениеПени", 									"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргУстановитьПроцентРаспределенияОтрицательногоОДН", 		"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргДополнительныеНачисления", 								"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргИзменениеВидаЗадолженности", 							"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргУстановитьДиапазоныДифференцированногоТарифа", 			"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргУстановитьЗначенияТарифовДиапазоновДифференцированногоТарифа", "Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргИсключениеАбонентаИзРаспределенияДиффТарифов", 			"Дата" , "Район", "Район");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.энргУстановитьКоэффициентИзмененияЛимитовДиффТарифов", 			"Дата" , "Район", "Район");
	
КонецПроцедуры

// Позволяет переопределить выполнение проверки запрета изменения произвольным образом.
//
// Если проверка выполняется в процессе записи документа, то в свойстве ДополнительныеСвойства документа Объект
// имеется свойство РежимЗаписи.
//  
// Параметры:
//  Объект       - СправочникОбъект,
//                 ДокументОбъект,
//                 ПланВидовХарактеристикОбъект,
//                 ПланСчетовОбъект,
//                 ПланВидовРасчетаОбъект,
//                 БизнесПроцессОбъект,
//                 ЗадачаОбъект,
//                 ПланОбменаОбъект, 
//                 РегистрСведенийНаборЗаписей,
//                 РегистрНакопленияНаборЗаписей,
//                 РегистрБухгалтерииНаборЗаписей,
//                 РегистрРасчетаНаборЗаписей - проверяемый элемент данных или набор записей 
//                 (который передается из обработчиков ПередЗаписью и ПриЧтенииНаСервере).
//
//  ПроверкаЗапретаИзменения    - Булево - установить в Ложь, чтобы пропустить проверку запрета изменения данных.
//  УзелПроверкиЗапретаЗагрузки - ПланыОбменаСсылка, Неопределено - установить в Неопределено, чтобы 
//                                пропустить проверку запрета загрузки данных.
//  ВерсияОбъекта               - Строка - установить "СтараяВерсия" или "НоваяВерсия", чтобы
//                                выполнить проверку только старой (в базе данных) 
//                                или только новой версии объекта (в параметре Объект).
//                                По умолчанию содержит значение "" - проверяются обе версии объекта сразу.
//
Процедура ПередПроверкойЗапретаИзменения(Объект,
                                         ПроверкаЗапретаИзменения,
                                         УзелПроверкиЗапретаЗагрузки,
                                         ВерсияОбъекта) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ЗапрещеноИзменятьДанные(ОбъектПроверки) Экспорт 
	
	Отказ = Ложь;
	
	Попытка
		ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ОбъектПроверки, Отказ, Истина, Истина);
	Исключение
		
		Отказ = Истина;
		
	КонецПопытки;
	
	Возврат Отказ;
	
КонецФункции

Функция КлючРазделаРайон() Экспорт  
	Возврат Новый УникальныйИдентификатор("9f160560-caf2-4c40-b8c5-62e6817c8fd0");
КонецФункции

#КонецОбласти
